Q-1. Write an SQL query to print the first three characters of  FIRST_NAME from Worker
table.

   SELECT LEFT([First_name],3)FROM Worker

Q-2. Write an SQL query to find the position of the alphabet (‘a’) in the first name
column ‘Amitabh’ from Worker table.

SELECT CHARINDEX('a',[First_name] COLLATE Latin1_General_CS_AS) FROM Worker 
WHERE [First_name] = 'Amitabh'

Q-3. Write an SQL query to print the name of employees having the highest salary in each
department.

select w1.first_name,w1.salary,w1.department from worker w1 join (select max(salary) as highest,department from wroker Group by department) w2 on w1.department =w2.department And w1.salary = w2.highest